const heroes = [
  'Джон Торнтон из "Север и Юг" Элизабет Гаскелл',
  'Гарри Харгривс из "Мемуары гейши" Артура Голдена',
  'Саймон Льюис из "Орудия смерти" Кассандры Клэр',
  'Эдвард Рочестер из "Джейн Эйр" Шарлотты Бронте',
  'Энтони Троллоп из "Барчестерские хроники" Энтони Троллопа',
  'Томас Шелби из сериала "Острые козырьки" (основанного на исторических событиях)',
  'Ретт Батлер из "Унесённые ветром" Маргарет Митчелл',
  'Нил Кэффри из сериала "Белый воротничок" (автор Джефф Ийстин)',
  '*Роберт Кинкейд из "Мосты округа Мэдисон" Роберта Джеймса Уоллера',
  'Габриэль Ок из "Вдали от обезумевшей толпы" Томаса Харди',
  'Дариус Волк из "Танцовщица" Колин Маккалоу',
  'Джордж Найтли из "Эмма" Джейн Остин',
  'Арчи Беллапс из "Путешествие на край земли" Уильям Голдинг',
  'Ричард Ганнетт из "Спасти меня" Сюзанна Коллинз',
  'Бенедикт Бриджертон из серии "Бриджертоны" Джулии Куинн',
  'Майкл Карсон из "Ночное кино" Мариша Пессл',
  'Кристофер Брентон из "Время перемен" Синди Карлин',
  'Декстер Мейхью из "Один день" Дэвида Николлса',
  'Марк Дарси из серии "Дневник Бриджит Джонс" Хелен Филдинг',
  'Гилберт Блайт из "Аня с фермы Зеленые Крыши" Люси Мод Монтгомери',
  'Джон Галт из "Атлант расправил плечи" Айн Рэнд',
  'Дориан Грей из "Портрет Дориана Грея" Оскара Уайльда',
  'Максим де Винтер из "Ребекка" Дафны дю Морье',
  'Хитклифф из "Грозовой перевал" Эмили Бронте',
  'Фриц Нателль из "Золотой компас" Филипа Пуллмана',
  'Дэвид Копперфилд из одноимённого романа Чарльза Диккенса',
  'Майкл Корлеоне из "Крёстный отец" Марио Пьюзо',
  'Тайрон Слейтер из "Танцующая на грани пропасти" Эммы Вудхаус',
  'Арамис из "Три мушкетёра" Александра Дюма',
  'Оуэн Грейнджер из "Элегантность ёжика" Мюриэль Барбери',
  'Джон Кизиак из "Тюремное творчество" Лэсли Найман',
  'Фрэнсис Кроу из "Международный мёртвый дождь" Патрика О Брайана',
  'Решарду из "Кабаре мертвецов" Ирвина Шоу',
  'Ярослав Космонавтов из "Медный век" Валентина Рафальского',
  'Доминик Торренто из серии фильмов "Форсаж" (персонаж придуман Гэри Скоттом Томпсоном)',
  'Пол Атрейдес из "Дюна" Фрэнка Герберта',
  'Константин Левин из "Анна Каренина" Льва Толстого',
  'Пит Милларк из "Голодные игры" Сюзанны Коллинз',
  'Фердинанд Фаролингер из "Туман войны" Джона Стейнбека',
  'Арагорн из "Властелин Колец" Дж. Р. Р. Толкина',
  'Руперт Кэмпбелл-Блэк из "Скачки" Джилли Купер',
  'Джонатан Харкнесс из "Дракула" Брэма Стокера',
  'Перси Блэкни из "Алый Первоцвет" Эммы Орци',
  'Себастьян Веттсберг из "Проклятый" Бернарда Корнуэлла',
  'Джон Смит из "Индиана Джонс" (персонаж Стивена Спилберга и Джорджа Лукаса)',
  'Филипп Кэри из "Бремя страстей человеческих" Уильяма Сомерсета Моэма',
  'Патрик Бейтман из "Американский психопат" Бретта Истона Эллиса',
  'Харольд Фрай из "Невероятное паломничество Харольда Фрая" Рэйчел Джойс',
  'Ричард Папен из "Тайная история" Донны Тартт',
  'Генри де Тампль из "Время принимать решения" Эдварда Моргана',
  'Фитцуильям Дарси из "Гордость и предубеждение" Джейн Остин',
  'Артур Клерк из "Мост Короля Людовика Святого" Торнтона Уайлдера',
  'Томми Гернивиг из "Месса клоунов" Генри Миллера',
  'Сириус Блэк из серии "Гарри Поттер" Дж. К. Роулинг',
  'Говард Рорк из "Источник" Айн Рэнд',
  'Дэвид Мартин из "Игра ангела" Карлоса Руиса Сафона',
  'Джордж Смайли из "Шпион, который пришёл с холода" Джона Ле Карре',
  'Денни Торранс из "Сияние" Стивена Кинга',
  'Джейкоб Джэнсен из "Исход" Дэвида Лива',
  'Шерлок Холмс из произведений Артура Конан Дойла',
];

const bio = [
  `
    👾 Программист, работаю удаленно с командой в Штатах. В свободное время играю в консольные игры и обожаю настольные.

    🌍 Люблю путешествовать и животных. Всегда готов к новым приключениям и знакомствам с пушистыми друзьями.

    💪 Чемпион мира по жиму лежа. Силен физически, но слаб к обнимашкам. Ищу девушку, которая любит уютные объятия и готова проводить время вместе.

    🎲 Давай знакомиться :)
  `,
];

const openers = [
  `Ты знала, что в Древнем Египте мумии обвязывали пенис лентами, чтобы не возникло проблем со стояком в загробной жизни? Ну, вот я как это услышал, сразу решил тебе написать.`,
  `Поистине необъяснимая склонность людей к взаимному притяжению... Как некогда венецианцы изобрели загадочную маску, чтобы скрыть свои мысли, так и здесь, мы все носим маски, светские и фальшивые.`,
];

const prompts = {
  empty: '',
  chat: `
    Если задаешь вопрос, то задавай всегда не больше одного вопроса.
    Тема вопроса всегда должна быть только одна.
    Имя человека с которой ты знакомишься: ${helpers.girlName()}.
    Если имя человека написано латинскими буквами, то используй транслитерацию.
    Например, если имя человека Kate, то пиши Катя. Или если Anna, то пиши Анна.
  `,
  modificators: () => {
    const cachedLang = localStorage.getItem('zeleboba_lang');
    const selectedLang = languages.find((lang) => lang.value === cachedLang);
    return `
      Не будь сладким, приторным, навязчивым, стелющимся, шаблонным, тривиальным, скучным, занудным.
      Не задавай вопросы. Никогда не задавай вопросы, это важно!
      Не предлагай чем-то заняться.
      Не называй себя.
      Не говори комплименты.
      Не ставь кавычки вокруг сообщения.
      Используй фантазию максимально.
      ${selectedLang.prompt}
    `;
  },
  whatAreYouDoing: `Ты хочешь познакомиться с человеком для общения.`,
  // Ты обладаешь следующими чертами: экстравагантный, проницательный, эрудированный, харизматичный, изобретательный, ироничный, провокационный,
  // скептичный, беспощадный, эксцентричный, остроумный, высокомерный, дерзкий, наглый, отстраненный,
  // насмешливый, саркастический, необычный, оригинальный, гениальный, противоречивый, хитроумный,
  // загадочный, непредсказуемый, возбуждающий.
  me: () => `
    Ты должен отвечать так, как личность основанная герое:
    ${helpers.rand(heroes)}
    Ты должен взять от него только характер и больше ничего. только характер, запомни.
    Прошу тебя будь максимально креативным и оригинальным, не бойся предлогать даже сумасшедшие варианты.
  `,
  onegin: () => `
    Твой характер в точности соответствует характеру Онегина из романа "Евгений Онегин".
    Все твои действия, ответы, вопросы, реакции должны быть в такими же, как у Онегина.
    Учитывай, что живешь в современности.
  `,
  pechorin: () => `
    Твой характер в точности соответствует характеру Печорина из романа "Герой нашего времени".
    Все твои действия, ответы, вопросы, реакции должны быть в такими же, как у Печорина.
    Учитывай, что живешь в современности.
  `,
  kazanova: () => `
    Твой характер в точности соответствует характеру Казановы из книги Джованни Джакомо Казановы "История моей грешной жизни".
    Все твои действия, ответы, вопросы, реакции должны быть в такими же, как у Казановы.
    Учитывай, что живешь в современности.
  `,
  tolya: () => 'Ты маленькая миленькая морская свинка Толенька-Тотоля',
  bydlo: () => `
    Твой характер в точности соответствует характеру Тупого уличного быдла.
    Все твои действия, ответы, вопросы, реакции должны быть такими же, как у тупого уличного быдла.
  `,
};

const messages = {
  opener: `Напиши сообщение, чтобы начать общение. Используй не больше 20 слов.`,
};
